УправДом/src/InformationRegisters/ТарифыКоммунальныхУслуг/ТарифыКоммунальныхУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ТарифыКоммунальныхУслуг</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Тариф</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ВидПлатежа</name>
    <type>
      <types>CatalogRef.ВидыПлатежей</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УправДом/src/InformationRegisters/ТарифыКоммунальныхУслуг/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


#Область ПрограммныйИнтерфейс

// Возвращает актуальный тариф для указанного вида платежа на указанную дату.
//
// Параметры:
//  ВидПлатежа - СправочникСсылка.ВидыПлатежей - Вид платежа, для которого нужно найти тариф.
//  ДатаАктуальности - Дата - Дата, на которую ищется актуальный тариф. По умолчанию - текущая.
//
// Возвращаемое значение:
//  Число - Значение тарифа. Если тариф не найден, возвращает 0.
//
Функция ПолучитьАктуальныйТариф(ВидПлатежа, ДатаАктуальности = Неопределено) Экспорт
	
	// Если дата не передана, используем текущую дату сеанса
	Если ДатаАктуальности = Неопределено Тогда
		ДатаАктуальности = ТекущаяДатаСеанса();
	КонецЕсли;
	
	// Проверка входных данных
	Если ВидПлатежа.Пустая() Тогда
		Возврат 0;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ТарифыКоммунальныхУслугСрезПоследних.Тариф КАК Тариф
		|ИЗ
		|	РегистрСведений.ТарифыКоммунальныхУслуг.СрезПоследних(&ДатаАктуальности,) КАК ТарифыКоммунальныхУслугСрезПоследних
		|ГДЕ
		|	ТарифыКоммунальныхУслугСрезПоследних.ВидПлатежа = &ВидПлатежа";
	
	Запрос.УстановитьПараметр("ВидПлатежа", ВидПлатежа);
	Запрос.УстановитьПараметр("ДатаАктуальности", ДатаАктуальности);
	
	Результат = Запрос.Выполнить();
	
	Если Не Результат.Пустой() Тогда
		Возврат Результат.Выгрузить()[0].Тариф;
	Иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции

#КонецОбласти


#КонецЕсли
